Revit 2026 API

# UIDocumentShowElements(Element) Method

---

Shows the element by zoom to fit.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ShowElements(
	Element element
)
```
```vb
Public Sub ShowElements (
	element As Element
)
```
```cpp
public:
void ShowElements(
	Element^ element
)
```
```fsharp
member ShowElements :
        element : Element -> unit
```

#### Parameters

element Element
    Element that will be shown.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Element is null. |

Places the element in the center of screen by moving the view.

#### Reference

UIDocument Class

ShowElements Overload

Autodesk.Revit.UI Namespace